<a href="https://colab.research.google.com/github/GuiSamuka/EloScience-Course/blob/main/01_Web_Scraping.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Task 1 - Importas as bibiotecas**

In [ ]:
# dataframes e manipulações
import pandas as pd

# requisitar dados do site
import requests

# inspecionar HTML
from bs4 import BeautifulSoup

# **Task 2 - Obter os dados dos jogadores**

In [ ]:
url = 'https://sofifa.com/players?offset='

In [ ]:
colunas = ['Nome', 'Idade', 'Posicao', 'Media', 'Potencial', 'Time', 'Salario', 'Total_Pontos']

In [ ]:
dados = pd.DataFrame(columns=colunas)
dados.head()

Empty DataFrame
Columns: [Nome, Idade, Posicao, Media, Potencial, Time, Salario, Total_Pontos]
Index: []

In [ ]:
for offset in range(0,100):
  url = url + str(offset*61)
  p_html = requests.get(url)
  p_soup = p_html.text
  data = BeautifulSoup(p_soup, 'html.parser')
  table = data.find('tbody')
  for i in table.findAll('tr'):
    td = i.findAll('td')
    Nome = td[1].findAll('a')[0].text
    Idade  = td[2].text
    Posicao = td[1].findAll('a')[1].text
    Media = td[3].find('span').text
    Potencial = td[4].find('span').text
    Time = td[5].find('a').text
    Salario = td[7].text.strip() 
    Total_Pontos = td[8].text.strip()

    dados_jogadores = pd.DataFrame([[Nome, Idade, Posicao, Media, Potencial, Time, Salario, Total_Pontos]])

    dados_jogadores.columns = colunas
    
    dados = dados.append(dados_jogadores, ignore_index=True)

In [ ]:
print(dados)

                Nome Idade Posicao  ...               Time Salario Total_Pontos
0         G. Obertan    31     CAM  ...     BB Erzurumspor     €7K         1753
1           P. Foden    20     CAM  ...    Manchester City    €95K         1997
2          S. García    29      ST  ...         Godoy Cruz    €12K         1847
3            Trincão    20      RW  ...       FC Barcelona    €95K         1906
4          A. Gignac    34      ST  ...    Tigres U.A.N.L.    €66K         2018
...              ...   ...     ...  ...                ...     ...          ...
5995   D. Szoboszlai    19     CAM  ...         RB Leipzig    €27K         1967
5996   J. Bellingham    17      CM  ...  Borussia Dortmund     €6K         1962
5997      K. Havertz    21     CAM  ...            Chelsea    €95K         2048
5998       T. Almada    19     CAM  ...    Vélez Sarsfield     €9K         2001
5999         Emerson    21      RB  ...         Real Betis    €17K         2011

[6000 rows x 8 columns]

# **Task 3 - Exportar os nossos dados**

In [ ]:
dados.to_csv('sds_fifa.csv', encoding='utf-8', index=False)

In [ ]:
dados.head()

          Nome Idade Posicao  ...             Time Salario Total_Pontos
0   G. Obertan    31     CAM  ...   BB Erzurumspor     €7K         1753
1     P. Foden    20     CAM  ...  Manchester City    €95K         1997
2    S. García    29      ST  ...       Godoy Cruz    €12K         1847
3      Trincão    20      RW  ...     FC Barcelona    €95K         1906
4    A. Gignac    34      ST  ...  Tigres U.A.N.L.    €66K         2018

[5 rows x 8 columns]

In [ ]:
#dados.to_excel('sds_fifa.xlsx', index=True)